{
  "backend/main.mo": "Main Motoko actor for VibeStream defining core types (UserProfile, Post, Comment, Hashtag) and implementing social features including profiles, posts, comments, likes, follows, trending, and hashtag management with role-based access control.",
  "feature_evidence.json": "Feature evidence report linking the LoginScreen redesign feature (animated branding, feature carousel, inline ProfileSetupModal wizard) to its affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON map of frontend source files to short summaries describing each component's purpose and notable bug fixes applied during the build.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property design tokens for light and dark themes including colors, radius, and sidebar variables.",
  "frontend/index.html": "HTML shell for the VibeStream PWA, setting viewport meta tags, theme color, PWA manifest link, and mounting the React app at the root div.",
  "frontend/public/manifest.json": "PWA web app manifest for VibeStream specifying app name, display mode, theme/background colors, and icon paths for 192×192 and 512×512 sizes.",
  "frontend/public/service-worker.js": "Service worker implementing cache-first strategy for static assets and network-first strategy for API/ICP calls, with install-time pre-caching and old cache cleanup on activate.",
  "frontend/src/App.tsx": "Root React component orchestrating the full auth and navigation flow: splash screen → login → inline profile setup wizard → main layout, using Internet Identity state and React Query for profile loading.",
  "frontend/src/components/BottomNav.tsx": "Fixed bottom navigation bar with four tabs (Home, Explore, Upload, Profile) using typed LucideProps icons, active state styling, and a gradient upload button.",
  "frontend/src/components/CommentsPanel.tsx": "A slide-up panel component for viewing, adding, and deleting comments on a post, with loading skeletons and identity-gated input.",
  "frontend/src/components/EditProfileModal.tsx": "A modal form for editing a user's profile username, bio, and avatar, including image upload with progress tracking and validation.",
  "frontend/src/components/ExploreView.tsx": "An explore page with a debounced search bar that switches between a trending posts grid and tabbed search results for users and posts.",
  "frontend/src/components/FeedView.tsx": "A vertically scrollable full-screen feed of video/photo posts that tracks the active item index and supports jumping to a specific start index.",
  "frontend/src/components/HeartAnimation.tsx": "A short-lived floating heart SVG animation component that calls an onDone callback after 800ms.",
  "frontend/src/components/MainLayout.tsx": "The root layout component that renders the active tab view (feed, explore, upload, or profile) alongside the bottom navigation bar.",
  "frontend/src/components/PostOverlay.tsx": "An overlay rendered on top of a post displaying the author info, caption, and optimistic like/comment action buttons.",
  "frontend/src/components/ProfileSetupModal.tsx": "A multi-step modal (username, bio, photo) for new user registration that validates input, handles avatar upload with progress tracking, and calls the registerUser mutation.",
  "frontend/src/components/ProfileView.tsx": "Displays a user's profile page with avatar, stats, posts grid, and follow/unfollow controls, supporting both own-profile and other-user views with edit and logout actions.",
  "frontend/src/components/UploadView.tsx": "A post creation view that lets users select a video (max 3 min) or image, add a caption with hashtags, and upload it via the createPost mutation with progress feedback.",
  "frontend/src/components/VideoPostCard.tsx": "A full-screen media card component that auto-plays/pauses video based on active state, supports double-tap to like with heart animation, mute toggle, and opens a comments panel.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and caches an authenticated or anonymous backend actor based on the current Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook that manage AuthClient lifecycle, login/logout flow, and expose the current identity and login status via React context.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating backend data including user profiles, posts, comments, and feed, using the ICP actor and Internet Identity for authentication.",
  "frontend/src/index.css": "Global stylesheet defining the VibeStream dark theme with OKLCH CSS variables, Tailwind layers, glassmorphism utility classes, neon glow effects, and scroll-snap feed layout.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/pages/LoginScreen.tsx": "Login page component displaying the VibeStream branding, an animated rotating feature showcase, and an Internet Identity login button.",
  "frontend/src/registerServiceWorker.ts": "Registers a service worker in production environments and listens for update events to detect new content availability.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters (supporting both standard and hash-based routing), persisting them to sessionStorage, and cleaning sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with VibeStream brand colors, OKLCH-based design tokens, custom fonts, neon box shadows, and accordion animations.",
  "project_state.json": "Tracks the VibeStream project state including architecture notes, existing features, and requirements for a mobile-first PWA social media app built with React/TypeScript frontend and Motoko backend on Internet Computer. Defines the dark neon theme, authentication approach, and all implemented feature IDs."
}