{
  "backend/main.mo": "Main Motoko actor for the VibeStream backend, defining core types (UserProfile, Post, Comment, Hashtag) and persistent storage maps for users, posts, comments, likes, follows, and trending data, with CRUD and social interaction endpoints.",
  "feature_evidence.json": "Feature evidence report confirming that the loading spinner/splash screen was removed from App.tsx, ensuring unauthenticated users see LoginScreen immediately and authenticated users go directly to MainLayout or ProfileSetupModal.",
  "frontend-file-summaries.txt": "JSON document summarizing each frontend source file's purpose and key fixes, serving as a build-planning reference for components like ExploreView, CommentsPanel, ProfileView, BottomNav, and App.tsx.",
  "frontend/index.css": "Global CSS entry point that imports Tailwind base/components/utilities and defines CSS custom properties for light and dark theme color tokens used throughout the app.",
  "frontend/index.html": "HTML shell for the VibeStream React app, setting PWA meta tags, theme color, Apple mobile web app settings, and mounting the React root with the main.tsx module entry point.",
  "frontend/public/manifest.json": "PWA web app manifest for VibeStream, specifying app name, display mode, theme/background colors, orientation, and icon paths for 192×192 and 512×512 sizes.",
  "frontend/public/service-worker.js": "Service worker implementing a cache-first strategy for static assets and network-first strategy for API/ICP calls, with install-time pre-caching and activation-time old-cache cleanup.",
  "frontend/src/App.tsx": "Root React component that routes between LoginScreen, ProfileSetupModal, and MainLayout based on authentication and profile state, with no loading spinner or intermediate splash screen at any point.",
  "frontend/src/components/BottomNav.tsx": "Fixed bottom navigation bar rendering four tabs (Home, Explore, Upload, Profile) with active-state styling and correct LucideProps typing for icon color support.",
  "frontend/src/components/CommentsPanel.tsx": "Bottom-sheet panel for viewing, adding, and deleting post comments, with skeleton loading states, author avatars, and an auto-focused input form.",
  "frontend/src/components/EditProfileModal.tsx": "A modal component for editing user profile fields (username, bio, avatar) with validation, image upload progress tracking, and error handling via toast notifications.",
  "frontend/src/components/ExploreView.tsx": "An explore page component featuring a debounced search bar that switches between a trending posts grid and search results (users/posts) based on query input.",
  "frontend/src/components/FeedView.tsx": "A vertical-scrolling feed component that tracks the active post index via scroll position and renders a list of VideoPostCard items with loading and empty states.",
  "frontend/src/components/HeartAnimation.tsx": "A simple overlay component that displays a floating heart SVG animation for 800ms then calls an onDone callback.",
  "frontend/src/components/MainLayout.tsx": "The root layout component that renders the active tab view (feed, explore, upload, or profile) alongside the bottom navigation bar.",
  "frontend/src/components/PostOverlay.tsx": "An overlay rendered on top of a post displaying the author's avatar, caption, and action buttons (like, comment) with optimistic local like state.",
  "frontend/src/components/ProfileSetupModal.tsx": "A multi-step (username → bio → photo) onboarding modal for new users to create their profile, with validation and avatar upload support.",
  "frontend/src/components/ProfileView.tsx": "Displays a user's profile page with avatar, stats, posts grid, and follow/unfollow controls. Supports both own profile (with edit/logout) and other users' profiles.",
  "frontend/src/components/UploadView.tsx": "Provides a form for selecting and uploading video or image posts with caption, hashtag extraction, and upload progress tracking.",
  "frontend/src/components/VideoPostCard.tsx": "Renders a single feed post card supporting video auto-play/pause, double-tap to like with heart animation, mute toggle, and a comments panel.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous ICP backend actor using React Query, reinitializing and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context with login, logout, and identity state management via DFINITY's AuthClient, exposed through a React context and hook.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend interactions including user profiles, feed/posts, likes, comments, and follow relationships.",
  "frontend/src/index.css": "Global CSS for VibeStream defining a dark neon theme with OKLCH CSS variables, Tailwind layers, glassmorphism utility classes, feed scroll-snap styles, and keyframe animations.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider and InternetIdentityProvider, then mounts to the DOM.",
  "frontend/src/pages/LoginScreen.tsx": "Login page component displaying animated branding, a rotating feature showcase carousel, and an Internet Identity login button with decorative background orbs.",
  "frontend/src/registerServiceWorker.ts": "Registers a service worker in production builds and listens for update events to detect new content availability.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters (supporting both standard and hash-based routing), persisting them to sessionStorage, and cleaning sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with VibeStream brand colors (neon purple, cyan, dark blacks), OKLCH-based semantic color tokens, custom border radii, neon box shadows, and accordion keyframe animations.",
  "project_state.json": "Project state manifest describing VibeStream's architecture, known issues (profile loading bug), and the list of implemented features with their requirement IDs and versions."
}