{
  "backend/main.mo": "Main Motoko actor for the VibeStream backend, defining core types (UserProfile, Post, Comment, Hashtag) and persistent state for users, posts, comments, likes, follows, and hashtags, with access-controlled query/update methods.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence fixes: resolving the infinite 'Loading your profile' screen in App.tsx and ensuring useQueries.ts profile hooks are disabled when the authenticated actor is unavailable.",
  "frontend-file-summaries.txt": "A JSON map of frontend source files to short summaries describing the key changes made to each component, including bug fixes for TypeScript errors, Tailwind class corrections, and auth flow improvements.",
  "frontend/index.css": "Global CSS entry point that imports Tailwind directives and defines CSS custom properties for light and dark theme color tokens used throughout the app.",
  "frontend/index.html": "HTML shell for the VibeStream PWA, setting viewport/theme meta tags, linking the web manifest and Apple touch icon, and mounting the React app via main.tsx.",
  "frontend/public/manifest.json": "PWA web app manifest for VibeStream, specifying app name, theme/background colors, standalone display mode, and two icon sizes (192×192 and 512×512).",
  "frontend/public/service-worker.js": "Service worker implementing a cache-first strategy for static assets and a network-first strategy for API/ICP calls, with install-time pre-caching and old cache cleanup on activation.",
  "frontend/src/App.tsx": "Root React component managing the full authentication and navigation flow (splash → login → profile loading → profile setup → main app), with explicit error/retry handling and a guard that prevents infinite loading once the profile query has settled.",
  "frontend/src/components/BottomNav.tsx": "Fixed bottom navigation bar rendering four tabs (Home, Explore, Upload, Profile) with active-state styling, using ComponentType<LucideProps> to correctly type icon components.",
  "frontend/src/components/CommentsPanel.tsx": "A slide-up panel component for viewing, adding, and deleting comments on a post, with loading skeletons and identity-gated input.",
  "frontend/src/components/EditProfileModal.tsx": "A modal form for editing a user's profile username, bio, and avatar, including image upload with progress tracking and validation.",
  "frontend/src/components/ExploreView.tsx": "An explore page with a debounced search bar that switches between a trending posts grid and tabbed search results for users and posts.",
  "frontend/src/components/FeedView.tsx": "A vertically scrolling full-screen feed of video/photo posts that tracks the active item index and supports jumping to a specific start index.",
  "frontend/src/components/HeartAnimation.tsx": "A short-lived floating heart SVG animation component that calls an onDone callback after 800ms.",
  "frontend/src/components/MainLayout.tsx": "The top-level layout component that renders the active tab view (feed, explore, upload, or profile) alongside the bottom navigation bar.",
  "frontend/src/components/PostOverlay.tsx": "An overlay rendered on top of a post showing the author's avatar, caption, and like/comment action buttons with optimistic like state.",
  "frontend/src/components/ProfileSetupModal.tsx": "A multi-step modal (username, bio, photo) for new user registration that validates input, handles avatar upload with progress tracking, and calls the registerUser mutation.",
  "frontend/src/components/ProfileView.tsx": "Displays a user's profile page with avatar, stats, posts grid, and follow/unfollow controls, supporting both own-profile and other-user views with edit and logout actions.",
  "frontend/src/components/UploadView.tsx": "A post creation view that lets users select a video (max 3 min) or image, add a caption with hashtags, and upload it via the createPost mutation with progress feedback.",
  "frontend/src/components/VideoPostCard.tsx": "A full-screen post card component that auto-plays/pauses video based on active state, supports double-tap to like with heart animation, mute toggle, and opens a comments panel.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and caches an authenticated or anonymous backend actor based on the current Internet Identity, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook that manage AuthClient lifecycle, login/logout flow, and expose the current identity and login status via React context.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data including user profiles, feed posts, comments, and media using the ICP actor and Internet Identity.",
  "frontend/src/index.css": "Global CSS for the VibeStream app, defining a dark OKLCH theme with neon purple/cyan accents, glassmorphism utility classes, TikTok-style feed scroll snapping, and custom animations.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/pages/LoginScreen.tsx": "Login page component displaying the VibeStream branding, an animated feature showcase carousel, and an Internet Identity login button.",
  "frontend/src/registerServiceWorker.ts": "Registers a service worker in production builds to enable PWA update detection.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with VibeStream brand colors, OKLCH CSS variable mappings, custom fonts, neon box shadows, and responsive breakpoints.",
  "project_state.json": "Tracks the VibeStream PWA project state (version 7), including architecture notes (React/TypeScript + Motoko on Internet Computer), existing features, known issues (stuck on loading profile screen), and a fix request flag."
}